
start_mes = 'Привет! \n\nЭтот бот работает в связке с каналом *Digital-трафик*. 😊 \n\nВ нем — я превращаю интересные механики, описанные в постах - в мини-курсы. \n\nЧтобы получить доступ к контенту — нажми на «Доступные курсы». 👇'


# пользовательская часть
show_courses = 'Снизу собраны доступные на сегодняшний день курсы. Нажимай на кнопку ниже 👇'
most_subscribe = 'Для получения курсов, вы должны подписаться на этот канал @trafficisobar'

ask_qustion = 'Отлично! Пожалуйста, напишите в ответ на это сообщение ваш вопрос.'



# админская часть


